# Ultralytics YOLO 🚀, AGPL-3.0 license
# YOLOv8 object detection model with P3-P5 outputs. For Usage examples see https://docs.ultralytics.com/tasks/detect

# Parameters
nc: 80 # number of classes
scales: # model compound scaling constants, i.e. 'model=yolov8n-exp.yaml' will call yolov8.yaml with scale 'n'
  # [depth, width, max_channels]
  n: [0.33, 0.25, 1024] # YOLOv8n-exp summary: 276 layers, 6219152 parameters, 6219136 gradients, 21.7 GFLOPs
  s: [0.33, 0.50, 1024] # YOLOv8s-exp summary: 276 layers, 24696160 parameters, 24696144 gradients, 85.5 GFLOPs
  m: [0.67, 0.75, 768] # YOLOv8m-exp summary: 367 layers, 46178032 parameters, 46178016 gradients, 161.0 GFLOPs
  l: [1.00, 1.00, 512] # YOLOv8l-exp summary: 458 layers, 64052992 parameters, 64052976 gradients, 248.3 GFLOPs
  x: [1.00, 1.25, 512] # YOLOv8x-exp summary: 458 layers, 100016208 parameters, 100016192 gradients, 387.3 GFLOPs

# YOLOv8.0n backbone
backbone:
  # [from, repeats, module, args]
  - [-1, 1, Conv, [64, 3, 2]] # 0-P1/2
  - [-1, 1, Conv, [128, 3, 2]] # 1-P2/4
  - [-1, 3, C2f, [128, True]]
  - [-1, 1, Conv, [256, 3, 2]] # 3-P3/8
  - [-1, 6, C2f, [256, True]]
  - [-1, 1, Conv, [512, 3, 2]] # 5-P4/16
  - [-1, 6, C2f, [512, True]]
  - [-1, 1, Conv, [1024, 3, 2]] # 7-P5/32
  - [-1, 3, C2f, [1024, True]]
  - [-1, 1, SPPF, [1024, 5]] # 9

# YOLOv8.0n-exp head
head:
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 6], 1, Concat, [1]] # cat backbone P4
  - [-1, 3, C2f, [512]] # 12

  - [-1, 1, nn.Upsample, [None, 2, "nearest"]]
  - [[-1, 4], 1, Concat, [1]] # cat backbone P3
  - [-1, 3, C2f, [256]] # 15 (P3/8-small)

  - [-1, 1, Conv, [256, 3, 2]]
  - [[-1, 12], 1, Concat, [1]] # cat head P4
  - [-1, 3, C2f, [512]] # 18 (P4/16-medium)

  - [-1, 1, nn.Upsample, [None, 0.5, "bilinear", True]] # 19 (P/32 - downsample to 20x20)
  - [18, 1, nn.Upsample, [None, 2, "nearest"]] # 20 (P4/8 - upsample to 80x80)

  - [18, 1, Conv, [512, 3, 2]]
  - [[-1, 9], 1, Concat, [1]] # cat head P5
  - [-1, 3, C2f, [1024]] # 23 (P5/32-large)
  - [-1, 1, nn.Upsample, [None, 2, "nearest"]] # 24 (P5/16 - upsample to 40x40)

  # Proposed model
  - [[23, 19], 1, Concat, [1]] # 25, P5 cat P4 (Large receptive field)
  - [-1, 3, C2f, [1024, False]] # 26 squeeze channels back to original

  - [[18, 24], 1, Concat, [1]] # 27, P4 cat P5 (Medium receptive field)
  - [-1, 3, C2f, [512, False]] # 28 squeeze channels back to original

  - [[15, 20], 1, Concat, [1]] # 29, P3 cat P4 (Small receptive field)
  - [-1, 3, C2f, [256, False]] # 30 squeeze channels back to original

  - [[26, 28, 30], 1, Detect, [nc]] # Detect(P3, P4, P5)
